package homework.day08;

public class LottoGameGenerator {

	public static void main(String[] args) {
		

	}

}

/*
(스캐너 객체 생성)
(반복문-while)
A. 인트로
사용자가 1번과 2번 중에 값을 직접 입력하여 선택한다.
(조건문)
1. Lotto 구입 > B.프로그램 시작
2. 프로그램 종료 > 프로그램 종료 (break)
(조건문 종료)

B. 프로그램 시작
"Lotto를 구입해주세요. (Lotto 하나 당 1000원)"

1) 사용자가 지불할 금액을 입력합니다. -- 지불한 금액 및 나머지 저장
"금액(원) : 사용자 입력" 

2) 지불한 금액을 토대로 Lotto 갯수를 구하고 -- 나누기 연산 -> 연산하여 나온 답(x)을 3번 배열에 담기

(반복문 - x만큼 반복)
3) Lotto 갯수에 맞춰 랜덤하게 번호를 생성 -- 요소가 6개인 2차원 배열을 만들기
4) 생성한 번호 출력
"Lotto 번호 : 랜덤번호"
(반복문 종료)

5) 지불한 금액과 나머지(거스름돈)를 출력합니다.

(반복문 종료)

C. 아웃트로
감사합니다.
*/